src/app/views/carts/show.html.erb


<% if @user.carts.length > 0 %>
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 2]]

                            <%= link_to listing_path(item.listing) do %>
                                <%= item.listing.size %> <%= item.listing.title %>
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]