src/app/controllers/carts_controller.rb

SELECT DISTINCT "carts"."listing_id" FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 2]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."listing_id" = $2 LIMIT $3  [["user_id", 2], ["listing_id", 1], ["LIMIT", 1]]
UPDATE "carts" SET "qty" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["qty", 2], ["updated_at", "2020-05-12 05:31:07.408117"], ["id", 2]]
INSERT INTO "carts" ("user_id", "listing_id", "created_at", "updated_at", "qty") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["listing_id", 8], ["created_at", "2020-05-12 05:40:34.959101"], ["updated_at", "2020-05-12 05:40:34.959101"], ["qty", 1]]
---
    def add
        get_user_and_cart
        get_listing
        if @user.carts.distinct.pluck(:listing_id).include?(@listing.id)
            cart_listing = @user.carts.find_by_listing_id(@listing.id)
            listing_qty = cart_listing.qty + 1
            cart_listing.update(qty: listing_qty)
        else
            @user.carts.create("listing_id" => @listing.id, "qty" => 1)

DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 2]]
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def remove
        Cart.find(params[:id]).destroy

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1  [["user_id", 2]]
---
    def get_user_and_cart
        @user = current_user
        @cart = Cart.where("user_id": @user.id)

SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def get_listing
        @listing = Listing.find(params[:id])