src/app/controllers/listings_controller.rb

    def create
        @listing = current_user.listings.create(listing_params)
---
INSERT INTO "listings" ("user_id", "title", "description", "in_stock", "created_at", "updated_at", "size") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 2], ["title", "Test"], ["description", ""], ["in_stock", true], ["created_at", "2020-05-10 01:21:58.133088"], ["updated_at", "2020-05-10 01:21:58.133088"], ["size", "Large"]]

    def update
        @listing = Listing.update(params["id"], listing_params)
        if @listing.errors.any?
---
UPDATE "listings" SET "title" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["title", "BouquetTesty"], ["updated_at", "2020-05-12 01:13:48.846973"], ["id", 4]]
SELECT "listings".* FROM "listings"

    def destroy
        Listing.find(params[:id]).destroy
---
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 6]]
SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

    def get_random_listings
        listingsArray = []
        i = 0
        while i <= 2
            listing = Listing.all.sample
---
SELECT "listings".* FROM "listings"