app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"
---
  def index
    @listings = Listing.all.sort_by(&:created_at).reverse

SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @listing = Listing.find(params[:id])
    @randomItems = get_random_listings

    if signed_in? && @listing.user != current_user
      session = Stripe::Checkout::Session.create(
        payment_method_types: ['card'],
        customer_email: current_user.email,
        line_items: [{
          name: "#{@listing.size} #{@listing.title}",
          description: @listing.description,
          amount: @listing.price.to_i * 100,
          currency: 'aud',
          quantity: 1,
        }],
        payment_intent_data: {
          metadata: {
            user_id: current_user.id,
            listing_id: @listing.id
          }
        },
        success_url: "#{root_url}payments/success?userId=#{current_user.id}&listingId=#{@listing.id}",
        cancel_url: "#{root_url}listings/#{@listing.id}"
      )

SELECT "listings".* FROM "listings"
---
  def all
    if current_user.admin
      @listings = Listing.all.sort_by(&:created_at).reverse
      @users = User.all
    else
      @listings = current_user.listings.all