app/controllers/pages_controller.rb

    def get_search_listings(query)
        query_listings = []
        all_listings = Listing.all
---
SELECT "listings".* FROM "listings"